#include <stdio.h>
#include <math.h>
#include <iostream>
#include <locale.h>
using namespace std;
int main()
{
	int a;
	setlocale(LC_ALL, "Russian");
	printf("Сколько учебных заданий?\n");
	scanf_s("%d", &a);
	if ((a < 100) or (a > 999)) {
		printf("Неверные данные\n");
	}
	else {
		if (a / 100 == 1) {
			printf("сто ");
		}
		if (a / 100 == 2) {
			printf("двести ");
		}
		if (a / 100 == 3) {
			printf("триста ");
		}
		if (a / 100 == 4) {
			printf("четыреста ");
		}
		if (a / 100 == 5) {
			printf("пятьсот ");
		}
		if (a / 100 == 6) {
			printf("шестьсот ");
		}
		if (a / 100 == 7) {
			printf("семьсот ");
		}
		if (a / 100 == 8) {
			printf("восемьсот ");
		}
		if (a / 100 == 9) {
			printf("девятьсот ");
		}
		if ((a % 100) / 10 == 2) {
			printf("двадцать ");
		}
		if ((a % 100) / 10 == 3) {
			printf("тридцать ");
		}
		if ((a % 100) / 10 == 4) {
			printf("сорок ");
		}
		if ((a % 100) / 10 == 5) {
			printf("пятьдесят ");
		}
		if ((a % 100) / 10 == 6) {
			printf("шестьдесят ");
		}
		if ((a % 100) / 10 == 7) {
			printf("семьдесят ");
		}
		if ((a % 100) / 10 == 8) {
			printf("восемьдесят ");
		}
		if ((a % 100) / 10 == 9) {
			printf("девяносто ");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 0)) {
			printf("десять");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 1)) {
			printf("одиннадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 2)) {
			printf("двенадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 3)) {
			printf("тринадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 4)) {
			printf("четырнадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 5)) {
			printf("пятнадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 6)) {
			printf("шестнадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 7)) {
			printf("семнадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 8)) {
			printf("восемнадцать");
		}
		if (((a % 100) / 10 == 1) and (a % 10 == 9)) {
			printf("девятнадцать");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 1)) {
			printf("один");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 2)) {
			printf("два");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 3)) {
			printf("три");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 4)) {
			printf("четыре");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 5)) {
			printf("пять");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 6)) {
			printf("шесть");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 7)) {
			printf("семь");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 8)) {
			printf("восемь");
		}
		if (((a % 100) / 10 != 1) and (a % 10 == 9)) {
			printf("девять");
		}

	}
	return 0;
}